Revit 2027 API
BuiltInFailures.ElectricalFailures.WireMaxSizeNonexistent Property
 Cannot find max size in current wire type's material table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WireMaxSizeNonexistent { get; }
Public Shared ReadOnly Property WireMaxSizeNonexistent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WireMaxSizeNonexistent {
	FailureDefinitionId^ get ();
}
static member WireMaxSizeNonexistent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace